class Song {
  String name;
  String details;
  String albumname;

  Song(this.name, this.details, this.albumname);
}

String song1_det =
    "పల్లవి : చెమ్మగిల్లు కళ్ళలోన కన్నీళ్లెంత కాలం\nకష్టాల బాటలోనె సాగదు పయనం\nవిడుదల సమీపించెను నీకు వెలుగు ఉదయించును\n\n(1)  నీవు మోసిన నిందకు ప్రతిగా - పూదండ ప్రభువు యిచ్చునులె\nనీవు పొందిన వేదనలన్ని - త్వరలో తీరిపోవునులె\nనీ స్థితి చూసి నవ్వినవారే - సిగ్గుపడే దినమొచ్చేనులే\nవిడుదల సమీపించెను నీకు వెలుగు ఉదయించును || చెమ్మగిల్లు||\n\n(2)  అనుభవించిన లేమి బాధలు - ఇకపై నీకు వుండవులే\nఅక్కరలోన ఉన్నవారికి - నీవే మేలు చేసే వులే\nమొదట నీ స్థితి కోంచమె ఉన్న - తుదకు వృద్ధిని పొందునులే\nవిడుదల సమీపించెను నీకు వెలుగు ఉదయించును || చెమ్మగిల్లు ||";
String song6_det =
    "నా విశ్వాస ఓడ యాత్ర కొనసాగుచున్నది\nకొనసాగించే యేసు నాకు తోడుండగా (2)\nతుఫానులైనా పెనుగాలులు అయినా ఆపలేవు నా యాత్రను\n\n1.  నా జీవిత యాత్రలో ఎన్నో తుఫానులు\nఅయినా నా యేసు నా పక్షమై ఉండగా\nతుఫానుణనచి పెనుగాలులు ఆపి నడిపించుము నా యేసయ్య\n\n2.  సీయోనుకే నా ఓడపయనం  ఆగదు ఏ చోట  \nవిశ్వాసముతోనే ఆరంభించితిని ఈ యాత్రను   \nనే కోరిన ఆ రేవుకె నడిపించును నా యేసయ్య \n\n3.  నీతి సూర్యుడు ఉదయించే వేళ ఇలలో ఆనందమే \nసూర్యోదయము కోసమే నే వేచి ఉన్నాను \nయేసయ్య రావా కొనిపోవా నన్ను ఇలలోన నీవే నాకు ";
String song7_det = "నజరేయుడా నా యేసయ్య "
    "ఎన్ని యుగాలకైనా"
    "ఆరాధ్య దైవము నీవేనని"
    "గళమెత్తి \nనీ కీర్తి నే చాటెద ||నజరేయుడా||\n\n"
    "ఆకాశ గగనాలను నీ జేనతో కొలిచితివి (2)"
    "\nశూన్యములో ఈ భూమిని"
    "వ్రేలాడదీసిన నా యేసయ్య (2)"
    "\nనీకే వందనం నీకే వందనం (2) ||నజరేయుడా||\n\n"
    "అగాధ సముద్రాలకు నీవే ఎల్లలు వేసితివి (2)"
    "\nజలములలోబడి నే వెళ్ళినా"
    "\nనన్నేమి చేయవు నా యేసయ్యా (2)"
    "\nనీకే వందనం నీకే వందనం (2) ||నజరేయుడా||\n\n"
    "సీయోను శిఖరాగ్రము నీ సింహాసనమాయెనా (2)"
    "\nసీయోనులో నిను చూడాలని"
    "ఆశతో ఉన్నాను నా యేసయ్యా (2)"
    "\nనీకే వందనం నీకే వందనం (2) ||నజరేయుడా||";
String song8_det = "యెహోవా నీ నామము - ఎంతో బలమైనదీ ఆ...ఆ...ఆ...ఎంతో బలమైనదీ"
    "\nయెసయ్య నీ నామము - ఎంతో ఘనమైనదీ ఆ...ఆ...ఆ...ఎంతో ఘనమైనదీ"
    "\n\n"
    "(1)  మోషే ప్రార్దించగా - మన్నాను కురిపించితివి"
    "\nయెహోషువ ప్రార్దించగా - సూర్యచంద్రుల నాపితివి"
    "\n||యెహోవా నీ నామము||\n\n"
    "(2)  నీ ప్రజల పక్షముగా - యుద్దములు చేసిన దేవా"
    "అగ్నిలో పడవేసినా - భయమేమి లేకుండిరి"
    "\n||యెహోవా నీ నామము||\n\n"
    "(3)  సింహాల బోనుకైనా - సంతోషముగా వెళ్ళిరి"
    "ప్రార్ధించిన వెంటనే - రక్షించె నీ హస్తము"
    "\n||యెహోవా నీ నామము||";
List songs = [
  Song("చెమ్మగిల్లు కళ్ళలోన కన్నీళ్లెంత కాలం", song1_det, "album"),
  Song(
      "ప్రాణేశ్వర  ప్రభు దైవకుమార",
      "ప్రాణేశ్వర  ప్రభు దైవకుమార ప్రణుతింతును నిన్నే- ఆశతీర ప్రాణేశ్వర  ప్రభు దైవకుమార",
      "album"),
  Song(
      "సొలిపొవలదు మనస్సా  సొలిపొవలదు",
      "ఇక్కట్టులు ఇబ్బందులు నిన్ను చుట్టు ముట్టినను .. ప్రియుడు నిన్ను చేరదీసిన ఆనందము కాదా?",
      "album"),
  Song(
      "నా నీతికి ఆధారమా ",
      "నా నీతికి ఆధారమా - నిబంధన మందసమా  అనుబంధమా మకరందమా - నాలో ఆనందమా  మహనీయుడా యేసయ్య - ఆరాధన నీకేనయ్యా   || నా నీతికి ఆధారమా ||",
      "album"),
  Song(
      "కృప కృప నా యేసు కృపా",
      "కృప కృప కృపా (2) \n నీ కొరకు నన్ను ముందుగానే నిర్ణయించితివే నీవు నన్ను పిలిచి నీ నీతినిచ్చి మహిమపరచితివే",
      "album"),
  Song("నా విశ్వాస ఓడ యాత్ర ", song6_det, "album"),
  Song("నజరేయుడా నా యేసయ్య", song7_det, "album"),
  Song("యెహోవా నీ నామము", song8_det, "album"),
  Song("Song9", "Lorem Ipsum", "album"),
  Song("Song10", "Ipsum Lorem", "album"),
];
